<?php
/**
 * 初始Laravel
 *      laravel简介
 *      laravel的版本选择
 *      MVC设计思想简介
 *
 * PHP框架简介
 *      什么是框架？
 *          为解决一定问题并按照一定的设计模式搭建的项目架构
 *      为什么要使用框架？
 *          框架提供了很多功能，比如数据库(DB)、缓存(Cache)、会话(Session)、文件上传等。
 *
 *          不但为前期开发提供了方便，更为后期项目性能的优化(缓存技术由文件换成Redis),
 *          平台的改变(数据库有Oracle换成Mysql)提供了技术保障
 *
 *      选择流行框架的优点
 *          文档齐全  社区活跃  后期支持好
 *
 *      laravel简介
 *          laravel是一套简洁、优雅的PHP web开发框架
 *          据用富于表达性且简洁的语法
 *          laravel是易于理解且强大的，它提供了强大的工具用以开发大型、健壮的应用
 *          具有验证、路由、session、缓存、数据库迁移工具、单元测试等常用的工具和功能
 *
 *      学习laravel的前提条件
 *          熟悉PHP语言
 *              了解面向对象、命名空间、Traits等
 *          熟悉关系型数据库Mysql
 *              了解数据库的表、记录、列等概念
 *          不需要具有框架使用经验
 *
 *
 *
 * 1-2 laravel版本选择
 *      LTS、非LTS
 *          长期支持(Long Time Support)
 *          laravel 遵守"早发布、常发布"的版本发布准则，这也是开源界通常的做法
 *          laravel与2015年6月9日正式发布第一个LTS版本5.1，并提供为期3前的安全补丁支持。
 *
 *      服务器环境
 *          适合的才是最好的
 *
 *
 * 1-3 MVC简介
 *      是框架、思想，不是设计模式
 *      Model: 应用程序中用于处理应用程序数据逻辑的部分，通常模型负责在数据库中存取数据
 *      View ：处理数据显示的部分
 *      Controller： 处理用户交互的部分。
 *          从model中获取数据，并输入到view 中
 *          接收view中的用户操作，然后做出相应的响应
 *
 *
 *
 * 2-1 laravel的安装及核心目录文件介绍
 *      开发环境的搭建
 *          laravel框架比较激进，大量使用PHP的新特性，所以对PHP的版本要求比较 高
 *          laravel个版本对PHP的要求
 *              5.1  5.2  PHP 5.5.9+
 *              4.2       PHP 5.4+
 *              4.1       PHP 5.3.7+
 *
 *          开发环境推荐
 *              Mac   mamp
 *              win   xampp
 *              Linux  自己编译
 *
 *      laravel的下载和安装
 *          laravel中文网
 *              http://www.golaravel.com/download
 *
 *      laravel的核心目录文件介绍
 *
 *
 *
 *
 *
 *
 *
 */






