<?php
/**
 * 第三章 Laravel中的路由和MVC
 *
 *      路由
 *      控制器
 *      视图
 *      模型
 *
 * 3-1 路由
 *      1.路由简介
 *      2.基本路由
 *      3.多请求路由
 *      4.路由参数
 *      5.路由别名
 *      6.路由群组
 *      7.路由中输出视图
 *
 *      1.路由简介
 *          简单的说就是将用户的请求转发给相应的程序进行处理
 *          作用就是建立url和程序之间的映射
 *          请求类型get、post、put、patch、delete
 *
 *      2.基本路由
 *
 *
 *  3-2 控制器
 *      1. 怎样新建一个控制器
 *      2. 控制器和路由怎样进行关联
 *      3. 关联控制器后，路由的特性怎么用
 *
 *  3-3 视图
 *      怎样新建视图
 *          info.php
 *          info.blade.php
 *
 *      怎样输出视图
 *          return view('info');
 *          return view('member/info');
 *          return view('member/info',['name'=>'sean']);
 *
 *  3-4 模型
 *      怎样新建模型
 *      怎样使用模型
 *
 *
 *
 */



