<?php
/**
 * 第五章  数据库查询操作之 - 查询构造器
 *      1. 查询构造器简介及新增数据
 *      2. 使用查询构造器修改数据
 *      3. 使用查询构造器删除数据
 *      4. 使用查询构造器查询数据
 *      5. 查询构造器中的聚合函数
 *
 * 5-1  查询构造器简介及新增数据
 *      查询构造器简介
 *          Laravel查询构造器(query builder)提供方便、流畅的接口，用来建立及执行数据库查找语法
 *
 *          使用PDO参数绑定，以保护应用程序免于SQL注入因此传入的参数不需要额外转义特殊字符
 *
 *          基本可以满足所有的数据库操作，而且在所有支持的数据库系统上都可以执行
 *
 *      使用查询构造器新增数据
 *
 * 5-2 使用查询构造器更新数据
 *      更新为指定的内容
 *      自增和自减
 *
 * 5-3 使用查询构造器删除数据
 *      delete
 *      truncate
 *
 * 5-4 使用查询构造器查询数据
 *      get()
 *      first()
 *      where()
 *      pluck()
 *      lists()
 *      select()
 *      chunk()
 *
 * 5-5 查询构造器中的聚合函数
 *      count()
 *      max()
 *      min()
 *      avg()
 *      sum()
 *
 *
 *
 *
 *
 *
 */



